TexasInstruments/mcupsdk-core/test/syscfg/syscfg_combo_1/am243x-evm/r5fss0-0_freertos/example.syscfg
section9.$name                       = "Log Shared Memory";
section9.load_memory                 = "LOG_SHM_MEM";
section9.type                        = "NOLOAD";
section9.group                       = false;
section9.output_section.create(1);
section9.output_section[0].$name     = ".bss.log_shared_mem";
section9.output_section[0].alignment = 0;

section10.$name                       = "IPC Shared Memory";
section10.type                        = "NOLOAD";
section10.load_memory                 = "RTOS_NORTOS_IPC_SHM_MEM";
section10.group                       = false;
section10.output_section.create(1);
section10.output_section[0].$name     = ".bss.ipc_vring_mem";
section10.output_section[0].alignment = 0;

section11.$name                       = "Non Cacheable Memory";
section11.load_memory                 = "NON_CACHE_MEM";
section11.group                       = false;
section11.type                        = "NOLOAD";
section11.output_section.create(1);
section11.output_section[0].$name     = ".bss.nocache";
section11.output_section[0].alignment = 0;

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
flash1.peripheralDriver.OSPI.$suggestSolution      = "OSPI0";
flash1.peripheralDriver.OSPI.CLK.$suggestSolution  = "OSPI0_CLK";
flash1.peripheralDriver.OSPI.CSn0.$suggestSolution = "OSPI0_CSn0";
flash1.peripheralDriver.OSPI.DQS.$suggestSolution  = "OSPI0_DQS";
flash1.peripheralDriver.OSPI.D7.$suggestSolution   = "OSPI0_D7";
flash1.peripheralDriver.OSPI.D6.$suggestSolution   = "OSPI0_D6";
flash1.peripheralDriver.OSPI.D5.$suggestSolution   = "OSPI0_D5";
flash1.peripheralDriver.OSPI.D4.$suggestSolution   = "OSPI0_D4";
flash1.peripheralDriver.OSPI.D3.$suggestSolution   = "OSPI0_D3";
flash1.peripheralDriver.OSPI.D2.$suggestSolution   = "OSPI0_D2";
flash1.peripheralDriver.OSPI.D1.$suggestSolution   = "OSPI0_D1";
flash1.peripheralDriver.OSPI.D0.$suggestSolution   = "OSPI0_D0";
adc1.ADC.$suggestSolution                          = "ADC0";
adc1.ADC.AIN0.$suggestSolution                     = "ADC0_AIN0";
adc1.ADC.AIN1.$suggestSolution                     = "ADC0_AIN1";
adc1.ADC.AIN2.$suggestSolution                     = "ADC0_AIN2";
adc1.ADC.AIN3.$suggestSolution                     = "ADC0_AIN3";
adc1.ADC.AIN4.$suggestSolution                     = "ADC0_AIN4";
adc1.ADC.AIN5.$suggestSolution                     = "ADC0_AIN5";
adc1.ADC.AIN6.$suggestSolution                     = "ADC0_AIN6";
adc1.ADC.AIN7.$suggestSolution                     = "ADC0_AIN7";
adc1.ADC.EXT_TRIGGER0.$suggestSolution             = "SPI0_CS1";
adc1.ADC.EXT_TRIGGER1.$suggestSolution             = "UART1_CTSn";
epwm1.EPWM.$suggestSolution                        = "EHRPWM0";
epwm1.EPWM.A.$suggestSolution                      = "GPMC0_AD3";
epwm1.EPWM.B.$suggestSolution                      = "GPMC0_AD4";
epwm1.EPWM.SYNCO.$suggestSolution                  = "GPMC0_AD1";
epwm1.EPWM.SYNCI.$suggestSolution                  = "GPMC0_AD0";
epwm2.EPWM.$suggestSolution                        = "EHRPWM3";
epwm2.EPWM.A.$suggestSolution                      = "GPMC0_AD13";
epwm2.EPWM.B.$suggestSolution                      = "GPMC0_AD14";
epwm2.EPWM.SYNCO.$suggestSolution                  = "GPMC0_CLK";
epwm2.EPWM.SYNCI.$suggestSolution                  = "GPMC0_AD15";
epwm3.EPWM.$suggestSolution                        = "EHRPWM6";
epwm3.EPWM.A.$suggestSolution                      = "SPI1_CS0";
epwm3.EPWM.B.$suggestSolution                      = "GPMC0_DIR";
epwm3.EPWM.SYNCO.$suggestSolution                  = "GPMC0_CSn1";
epwm3.EPWM.SYNCI.$suggestSolution                  = "GPMC0_CSn0";
fsi_rx1.FSI_RX.$suggestSolution                    = "FSI_RX5";
fsi_rx1.FSI_RX.CLK.$suggestSolution                = "GPMC0_ADVn_ALE";
fsi_rx1.FSI_RX.D0.$suggestSolution                 = "GPMC0_OEn_REn";
fsi_rx1.FSI_RX.D1.$suggestSolution                 = "GPMC0_WEn";
fsi_rx2.FSI_RX.$suggestSolution                    = "FSI_RX0";
fsi_rx2.FSI_RX.CLK.$suggestSolution                = "GPMC0_AD8";
fsi_rx2.FSI_RX.D0.$suggestSolution                 = "GPMC0_AD9";
fsi_rx2.FSI_RX.D1.$suggestSolution                 = "GPMC0_AD10";
fsi_tx1.FSI_TX.$suggestSolution                    = "FSI_TX1";
fsi_tx1.FSI_TX.CLK.$suggestSolution                = "GPMC0_WPn";
fsi_tx1.FSI_TX.D0.$suggestSolution                 = "GPMC0_BE0n_CLE";
fsi_tx1.FSI_TX.D1.$suggestSolution                 = "GPMC0_WAIT1";
gpio2.GPIO_n.$suggestSolution                      = "OSPI0_LBCLKO";
i2c1.I2C.$suggestSolution                          = "I2C3";
i2c1.I2C.SCL.$suggestSolution                      = "MCAN1_TX";
i2c1.I2C.SDA.$suggestSolution                      = "MCAN1_RX";
i2c2.I2C.$suggestSolution                          = "I2C0";
i2c2.I2C.SCL.$suggestSolution                      = "I2C0_SCL";
i2c2.I2C.SDA.$suggestSolution                      = "I2C0_SDA";
i2c3.I2C.$suggestSolution                          = "I2C2";
i2c3.I2C.SCL.$suggestSolution                      = "GPMC0_CSn2";
i2c3.I2C.SDA.$suggestSolution                      = "GPMC0_CSn3";
i2c4.I2C.$suggestSolution                          = "I2C1";
i2c4.I2C.SCL.$suggestSolution                      = "I2C1_SCL";
i2c4.I2C.SDA.$suggestSolution                      = "I2C1_SDA";
mcan1.MCAN.$suggestSolution                        = "MCAN0";
mcan1.MCAN.RX.$suggestSolution                     = "MCAN0_RX";
mcan1.MCAN.TX.$suggestSolution                     = "MCAN0_TX";
mcspi1.SPI.$suggestSolution                        = "SPI3";
mcspi1.SPI.CLK.$suggestSolution                    = "PRG0_PRU0_GPO16";
mcspi1.SPI.D0.$suggestSolution                     = "PRG0_PRU0_GPO13";
mcspi1.SPI.D1.$suggestSolution                     = "PRG0_PRU0_GPO14";
mcspi1.mcspiChannel[0].CSn.$suggestSolution        = "PRG0_PRU0_GPO17";
mcspi2.SPI.$suggestSolution                        = "SPI1";
mcspi2.SPI.CLK.$suggestSolution                    = "SPI1_CLK";
mcspi2.SPI.D0.$suggestSolution                     = "SPI1_D0";
mcspi2.SPI.D1.$suggestSolution                     = "SPI1_D1";
mcspi2.mcspiChannel[0].CSn.$suggestSolution        = "SPI1_CS1";
mcspi3.SPI.$suggestSolution                        = "SPI0";
mcspi3.SPI.CLK.$suggestSolution                    = "SPI0_CLK";
mcspi3.SPI.D0.$suggestSolution                     = "SPI0_D0";
mcspi3.SPI.D1.$suggestSolution                     = "SPI0_D1";
mcspi3.mcspiChannel[0].CSn.$suggestSolution        = "SPI0_CS0";
debug_log.uartLog.UART.RXD.$suggestSolution        = "UART0_RXD";
debug_log.uartLog.UART.TXD.$suggestSolution        = "UART0_TXD";
timer1.TIMER.$suggestSolution                      = "DMTIMER7";
timer2.TIMER.$suggestSolution                      = "DMTIMER6";
timer3.TIMER.$suggestSolution                      = "DMTIMER5";
timer4.TIMER.$suggestSolution                      = "DMTIMER4";
timer5.TIMER.$suggestSolution                      = "DMTIMER3";
timer6.TIMER.$suggestSolution                      = "DMTIMER2";
timer7.TIMER.$suggestSolution                      = "DMTIMER1";
timer8.TIMER.$suggestSolution                      = "DMTIMER0";
